; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)   
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)
        (increase (total-cost) (fly-cost ?location_from ?location_to))        
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l5_p5_c5_g5_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(person-at person1 loc2)
	(person-at person2 loc3)
	(person-at person3 loc3)
	(person-at person4 loc2)
	(person-at person5 loc4)
(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 179)
	(= (fly-cost depot loc2) 56)
	(= (fly-cost depot loc3) 134)
	(= (fly-cost depot loc4) 111)
	(= (fly-cost depot loc5) 221)
	(= (fly-cost loc1 depot) 179)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 133)
	(= (fly-cost loc1 loc3) 78)
	(= (fly-cost loc1 loc4) 115)
	(= (fly-cost loc1 loc5) 43)
	(= (fly-cost loc2 depot) 56)
	(= (fly-cost loc2 loc1) 133)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 108)
	(= (fly-cost loc2 loc4) 102)
	(= (fly-cost loc2 loc5) 174)
	(= (fly-cost loc3 depot) 134)
	(= (fly-cost loc3 loc1) 78)
	(= (fly-cost loc3 loc2) 108)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 38)
	(= (fly-cost loc3 loc5) 112)
	(= (fly-cost loc4 depot) 111)
	(= (fly-cost loc4 loc1) 115)
	(= (fly-cost loc4 loc2) 102)
	(= (fly-cost loc4 loc3) 38)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 149)
	(= (fly-cost loc5 depot) 221)
	(= (fly-cost loc5 loc1) 43)
	(= (fly-cost loc5 loc2) 174)
	(= (fly-cost loc5 loc3) 112)
	(= (fly-cost loc5 loc4) 149)
	(= (fly-cost loc5 loc5) 1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate5 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space1)
   goals met: 1 of 6
2. (put-crate-in-carrier crate3 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space2)
   goals met: 1 of 6
3. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 0 of 6
4. (pick-and-drop crate3 loc3 drone1 carrier1 space2 person2 food)
   deleted: (crate-at-space crate3 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person2 food)
   goals met: 1 of 6
5. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 6
6. (put-crate-in-carrier crate2 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space2)
   goals met: 2 of 6
7. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 1 of 6
8. (pick-and-drop crate2 loc3 drone1 carrier1 space2 person3 food)
   deleted: (crate-at-space crate2 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 food)
   goals met: 2 of 6
9. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 6
10. (put-crate-in-carrier crate1 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space2)
   goals met: 3 of 6
11. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 2 of 6
12. (pick-and-drop crate1 loc2 drone1 carrier1 space2 person4 food)
   deleted: (crate-at-space crate1 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person4 food)
   goals met: 3 of 6
13. (pick-and-drop crate5 loc2 drone1 carrier1 space1 person1 medicine)
   deleted: (crate-at-space crate5 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 medicine)
   goals met: 4 of 6
14. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 6
15. (put-crate-in-carrier crate4 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space1)
   goals met: 5 of 6
16. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 4 of 6
17. (pick-and-drop crate4 loc3 drone1 carrier1 space1 person3 medicine)
   deleted: (crate-at-space crate4 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person3 medicine)
   goals met: 5 of 6
18. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 6
